In [2]:
import pandas as pd

In [6]:
import pycountry

def get_country_name_from_code(code):
    try:
        country = pycountry.countries.get(alpha_3=code)
        return country.name
    except AttributeError:
        return "Unknown"
df=pd.read_csv("arrivals_soe.csv")

In [139]:
import pycountry

def get_country_name_from_code2(code):
    try:
        # Attempt to get country using alpha_2 code
        country = pycountry.countries.get(alpha_2=code)
        if country:
            return country.name
        else:
            return "Unknown"
    except LookupError:
        # Return "Unknown" for invalid codes
        return "Unknown"
    except Exception as e:
        # Log or print the exception for debugging
        print(f"Error: {e}")
        return "Unknown"

In [140]:
lst=[]
df = df.rename(columns={'country': 'code'})
for a in df["code"]:
    b=get_country_name_from_code(a)
    lst.append(b)
df["country"]=lst

In [142]:
df2=df2.drop(columns="Country")
df2=df2.drop(columns="Code")

In [143]:
joined=pd.merge(df, df2, on="country", how="inner")

In [146]:
joined.to_csv('final file.csv', index=False)

In [3]:
final=pd.read_csv("final file.csv")

In [7]:
final['date'] = pd.to_datetime(final['date'])
final['date'] = final['date'].dt.strftime('%b %Y')

In [11]:
# Assuming 'final' is your DataFrame
grouped_df = final.groupby(["date", "code", "soe"]).sum().reset_index()

In [20]:
filtered_df = grouped_df[grouped_df['arrivals'] > 0]

In [21]:
filtered_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 34457 entries, 35 to 87686
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             34457 non-null  object
 1   code             34457 non-null  object
 2   soe              34457 non-null  object
 3   arrivals         34457 non-null  int64
 4   arrivals_male    34457 non-null  int64
 5   arrivals_female  34457 non-null  int64
 6   country          34457 non-null  object
 7   latitude         34457 non-null  float64
 8   longitude        34457 non-null  float64
dtypes: float64(2), int64(3), object(4)
memory usage: 2.6+ MB

In [3]:
filtered_df.to_csv("grouped_arrivals.csv")

NameError: name 'filtered_df' is not defined

In [22]:
grouped_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87687 entries, 0 to 87686
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             87687 non-null  object
 1   code             87687 non-null  object
 2   soe              87687 non-null  object
 3   arrivals         87687 non-null  int64
 4   arrivals_male    87687 non-null  int64
 5   arrivals_female  87687 non-null  int64
 6   country          87687 non-null  object
 7   latitude         87687 non-null  float64
 8   longitude        87687 non-null  float64
dtypes: float64(2), int64(3), object(4)
memory usage: 6.0+ MB

In [4]:
a=pd.read_csv("grouped_arrivals.csv")

In [25]:
import pandas as pd

# Load the Big Mac Index dataset
url_big_mac = "https://raw.githubusercontent.com/TheEconomist/big-mac-data/refs/heads/master/source-data/big-mac-source-data-v2.csv"
bigmac = pd.read_csv(url_big_mac)

# Load your own dataset
url_your_dataset = "path_to_your_dataset.csv"

# Filter the Big Mac dataset for the year 2023
bigmac= bigmac[bigmac['date'].str.contains('2023')]
a=pd.read_csv("grouped_arrivals.csv")
a= a[a['date'].str.contains('2023')]

# Rename the column in the Big Mac dataset
bigmac= bigmac.rename(columns={"iso_a3": "code"})
bigmac["adjust_price"]=bigmac["local_price"]/bigmac["dollar_ex"]

In [26]:
a=pd.read_csv("grouped_arrivals.csv")
a= a[a['date'].str.contains('2023')]
summed = a.groupby(["code"]).sum()[["arrivals"]]
summed = summed.reset_index()
summed.columns = ['code', 'arrivals']

In [33]:
md = pd.merge(summed, bigmac, on="code")
md = md.iloc[1::2]
md.to_csv("bubbleChart_pictograph.csv")

In [34]:
md.head()

,code,arrivals,name,currency_code,local_price,dollar_ex,GDP_dollar,GDP_local,date,adjust_price
1,ARE,8475.0,United Arab Emirates,AED,18.00,3.67305,52625.126,193265.777,2023-07-01,4.900559
3,ARG,6162.0,Argentina,ARS,1650.00,275.27500,13640.410,1782994.200,2023-07-01,5.994006
5,AUS,409096.0,Australia,AUD,7.45,1.48401,65574.862,94358.390,2023-07-01,5.020183
7,AUT,14358.0,Austria,EUR,4.81,0.90699,52483.930,49800.808,2023-07-01,5.303256
9,AZE,1712.0,Azerbaijan,AZN,5.95,1.70250,7822.589,13298.401,2023-07-01,3.494860

In [13]:
summed.head()

      arrivals
code
AFG      684.0
AGO       78.0
AIA        1.0
ALB      627.0
AND       88.0

In [9]:
a.head()

,Unnamed: 0,date,code,soe,arrivals,arrivals_male,arrivals_female,country,latitude,longitude
877,5123,Apr 2023,AFG,Johor,2.0,2.0,0.0,Afghanistan,33.939110,67.709953
878,5124,Apr 2023,AFG,Kedah,1.0,1.0,0.0,Afghanistan,33.939110,67.709953
879,5127,Apr 2023,AFG,Sarawak,1.0,1.0,0.0,Afghanistan,33.939110,67.709953
880,5128,Apr 2023,AFG,Selangor,31.0,23.0,8.0,Afghanistan,33.939110,67.709953
881,5129,Apr 2023,AGO,Johor,2.0,0.0,2.0,Angola,-11.202692,17.873887

In [45]:
bigmac

,name,code,currency_code,local_price,dollar_ex,GDP_dollar,GDP_local,date,adjust_price
1946,United Arab Emirates,ARE,AED,18.00,3.67300,52625.126,1.932658e+05,2023-01-01,4.900626
1947,Argentina,ARG,ARS,980.00,184.69875,13640.410,1.782994e+06,2023-01-01,5.305937
1948,Australia,AUS,AUD,7.25,1.41854,65574.862,9.435839e+04,2023-01-01,5.110888
1949,Austria,AUT,EUR,4.48,0.91950,52483.930,4.980081e+04,2023-01-01,4.872213
1950,Azerbaijan,AZE,AZN,4.90,1.70250,7822.589,1.329840e+04,2023-01-01,2.878120
...,...,...,...,...,...,...,...,...,...
2083,Ukraine,UKR,UAH,105.00,36.93145,4582.609,1.481953e+05,2023-07-01,2.843105
2084,Uruguay,URY,UYU,259.00,37.76500,19737.342,8.125403e+05,2023-07-01,6.858202
2085,United States,USA,USD,5.58,1.00000,77191.871,7.719187e+04,2023-07-01,5.580000
2086,Vietnam,VNM,VND,74000.00,23687.50000,4101.730,9.600417e+07,2023-07-01,3.124011
2087,South Africa,ZAF,ZAR,49.90,17.78375,6684.479,1.093748e+05,2023-07-01,2.805932

In [78]:
import pandas as pd
gdp=pd.read_csv("gdp_capita.csv")

In [79]:
# Set row 3 (index 2) as the new header
gdp.columns = gdp.iloc[3]

# Drop the first 3 rows to clean up the DataFrame (including the row used as the new header)
gdp = gdp.drop([0, 1, 2, 3]).reset_index(drop=True)

In [80]:
gdp=gdp[["Country Code", 2023.0]]

In [81]:
gdp=gdp.rename(columns={"Country Code": "code", 2023.0: "gdp_capita"})

In [83]:

md = pd.merge(md, gdp, on="code", how="left")

In [84]:
md["gdp_capita"]=round(md["gdp_capita"])

In [85]:
md.head()

,name,code,currency_code,local_price,dollar_ex,GDP_dollar,GDP_local,date,adjust_price,arrivals,gdp_capita
0,United Arab Emirates,ARE,AED,18.00,3.67300,52625.126,193265.777,2023-01-01,4.900626,8475.0,52977.0
1,Argentina,ARG,ARS,980.00,184.69875,13640.410,1782994.200,2023-01-01,5.305937,6162.0,13731.0
2,Australia,AUS,AUD,7.25,1.41854,65574.862,94358.390,2023-01-01,5.110888,409096.0,64712.0
3,Austria,AUT,EUR,4.48,0.91950,52483.930,49800.808,2023-01-01,4.872213,14358.0,56506.0
4,Azerbaijan,AZE,AZN,4.90,1.70250,7822.589,13298.401,2023-01-01,2.878120,1712.0,7155.0

In [2]:
import pandas as pd

In [86]:
dist=pd.read_csv("https://raw.githubusercontent.com/rahulbot/distances-between-countries/refs/heads/master/distances.csv")

In [87]:
dist = dist.rename(columns={dist.columns[0]: 'code'})
dist=dist[["code", "MYS"]]
dist=dist.rename(columns={"MYS": "distance"})

In [88]:
dist

    code      distance
0    ABW  17772.198137
1    AFG   4627.929927
2    AGO  10012.910963
3    AIA  16872.110747
4    ALB   8930.954065
..   ...           ...
230  WSM   9748.630964
231  YEM   6411.044984
232  ZAF   9822.689546
233  ZMB   8491.259645
234  ZWE   8253.128523

[235 rows x 2 columns]

In [89]:
md = pd.merge(md, dist, on="code", how="left")

In [90]:
md["distance"]=round(md["distance"])

In [91]:
md.to_csv("bubbleChart_pictograph.csv")

In [26]:
subreg=pd.read_csv("subregion.csv")
md=pd.read_csv("grouped_arrivals.csv")

In [27]:
subreg=subreg[["alpha-3", "sub-region", "region"]]

In [28]:

subreg = subreg.rename(columns={"alpha-3": "code"})

In [29]:
md = pd.merge(md, subreg, on="code", how="left")

In [30]:
md = md.drop(columns=["Unnamed: 0"])

In [31]:
import pandas as pd
md = md.groupby(["date", "region"])["arrivals"].mean().reset_index()

In [32]:
md["arrivals"]=round(md["arrivals"])
md.to_csv("streamgraph.csv")

In [25]:
md

,Unnamed: 0,date,code,soe,arrivals,arrivals_male,arrivals_female,country,latitude,longitude,sub-region,region
0,35,Apr 2020,ARE,Selangor,2.0,2.0,0.0,United Arab Emirates,23.424076,53.847818,Western Asia,Asia
1,73,Apr 2020,AUS,Selangor,9.0,8.0,1.0,Australia,-25.274398,133.775136,Australia and New Zealand,Oceania
2,77,Apr 2020,AUT,Kedah,1.0,1.0,0.0,Austria,47.516231,14.550072,Western Europe,Europe
3,103,Apr 2020,BEL,Johor,1.0,0.0,1.0,Belgium,50.503887,4.469936,Western Europe,Europe
4,114,Apr 2020,BEL,Selangor,6.0,6.0,0.0,Belgium,50.503887,4.469936,Western Europe,Europe
...,...,...,...,...,...,...,...,...,...,...,...,...
34453,87681,Sep 2023,ZWE,Perak,1.0,0.0,1.0,Zimbabwe,-19.015438,29.154857,Sub-Saharan Africa,Africa
34454,87684,Sep 2023,ZWE,Sabah,1.0,1.0,0.0,Zimbabwe,-19.015438,29.154857,Sub-Saharan Africa,Africa
34455,87685,Sep 2023,ZWE,Sarawak,2.0,2.0,0.0,Zimbabwe,-19.015438,29.154857,Sub-Saharan Africa,Africa
34456,87686,Sep 2023,ZWE,Selangor,181.0,95.0,86.0,Zimbabwe,-19.015438,29.154857,Sub-Saharan Africa,Africa
34457,87687,pivot,MYS,NaN,NaN,NaN,NaN,Malaysia,4.210500,101.975800,South-eastern Asia,Asia

In [10]:
import pandas as pd
md=pd.read_csv("streamgraph.csv")
reg=pd.read_csv("subregion.csv")

In [65]:
bigmac=pd.read_csv("bubbleChart_pictograph.csv")

In [66]:
bigmac=bigmac[["name", "adjust_price", "arrivals", "code"]]
bigmac_unique = bigmac.drop_duplicates(subset='code')

In [76]:
top_20_sorted = bigmac.sort_values(by='arrivals', ascending=False).head(30)
res = bigmac.sample(n=10, random_state=42)

In [81]:
a=top_20_sorted.drop_duplicates(subset=["name"], keep='last').sort_values(by="arrivals", ascending=False)

In [10]:
import pandas as pd

# Create a list of the date strings from the array
date_strings = ['Apr 2020', 'Apr 2021', 'Apr 2022', 'Apr 2023', 'Apr 2024',
                'Aug 2020', 'Aug 2021', 'Aug 2022', 'Aug 2023', 'Dec 2020',
                'Dec 2021', 'Dec 2022', 'Dec 2023', 'Feb 2020', 'Feb 2021',
                'Feb 2022', 'Feb 2023', 'Feb 2024', 'Jan 2020', 'Jan 2021',
                'Jan 2022', 'Jan 2023', 'Jan 2024', 'Jul 2020', 'Jul 2021',
                'Jul 2022', 'Jul 2023', 'Jun 2020', 'Jun 2021', 'Jun 2022',
                'Jun 2023', 'Jun 2024', 'Mar 2020', 'Mar 2021', 'Mar 2022',
                'Mar 2023', 'Mar 2024', 'May 2020', 'May 2021', 'May 2022',
                'May 2023', 'May 2024', 'Nov 2020', 'Nov 2021', 'Nov 2022',
                'Nov 2023', 'Oct 2020', 'Oct 2021', 'Oct 2022', 'Oct 2023',
                'Sep 2020', 'Sep 2021', 'Sep 2022', 'Sep 2023']

# Convert strings to datetime format
dates = pd.to_datetime(date_strings, format='%b %Y')

# Filter for dates in the year 2024
dates_2024 = dates[dates.year == 2024]

print(dates_2024)

DatetimeIndex(['2024-04-01', '2024-02-01', '2024-01-01', '2024-06-01',
               '2024-03-01', '2024-05-01'],
              dtype='datetime64[ns]', freq=None)